poc-framework-spring/poc-framework-spring-10-webservices-soap/src/main/resources/soap-messages-samples/oxigenXML-sample.wssc

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-CALL>
    <SOAP-FIELDS>
        <service xml:space="preserve">pokerService</service>
        <port xml:space="preserve">pokerPort</port>
        <operation xml:space="preserve">EvaluateHand</operation>
        <URL xml:space="preserve">http://localhost:8080/poker/services</URL>
        <action xml:space="preserve"></action>
        <soapVersion xml:space="preserve">1.1</soapVersion>
    </SOAP-FIELDS>
    <REQUEST><![CDATA[&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;
    xmlns:schemas=&quot;http://www.springinaction.com/poker/schemas&quot;&gt;
    &lt;SOAP-ENV:Header/&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;schemas:EvaluateHandRequest&gt;
            &lt;schemas:card&gt;
                &lt;schemas:suit&gt;DIAMONDS&lt;/schemas:suit&gt;
                &lt;schemas:face&gt;ACE&lt;/schemas:face&gt;
            &lt;/schemas:card&gt;
             &lt;schemas:card&gt;
                &lt;schemas:suit&gt;CLUBS&lt;/schemas:suit&gt;
                &lt;schemas:face&gt;ACE&lt;/schemas:face&gt;
            &lt;/schemas:card&gt;
                        &lt;schemas:card&gt;
                &lt;schemas:suit&gt;CLUBS&lt;/schemas:suit&gt;
                &lt;schemas:face&gt;KING&lt;/schemas:face&gt;
            &lt;/schemas:card&gt;
             &lt;schemas:card&gt;
                &lt;schemas:suit&gt;SPADES&lt;/schemas:suit&gt;
                &lt;schemas:face&gt;KING&lt;/schemas:face&gt;
            &lt;/schemas:card&gt;
                        &lt;schemas:card&gt;
                &lt;schemas:suit&gt;HEARTS&lt;/schemas:suit&gt;
                &lt;schemas:face&gt;KING&lt;/schemas:face&gt;
            &lt;/schemas:card&gt;
        &lt;/schemas:EvaluateHandRequest&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
]]></REQUEST>
</SOAP-CALL>
